app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "author", "entry_id", "upload", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save