app/controllers/bakers_controller.rb

  def index
    @bakers = Baker.all
---
SELECT "bakers".* FROM "bakers"

  def create
    @baker = Baker.new(baker_params)

    respond_to do |format|
      if @baker.save
---
INSERT INTO "bakers" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", ""], ["email", ""], ["created_at", "2015-11-08 02:37:12.642161"], ["updated_at", "2015-11-08 02:37:12.642161"]]

    def set_baker
      @baker = Baker.find(params[:id])
---
SELECT  "bakers".* FROM "bakers" WHERE "bakers"."id" = ? LIMIT 1  [["id", 1]]